# Reshape pandas dataframe with pivot_table
---

In [1]:
import pandas as pd

## Create long data
---

In [2]:
df_long = pd.DataFrame({
        "student":
            ["Andy", "Bernie", "Cindy", "Deb",
             "Andy", "Bernie", "Cindy", "Deb",
             "Andy", "Bernie", "Cindy", "Deb"],
        "school":
            ["Z", "Y", "Z", "Y",
             "Z", "Y", "Z", "Y",
             "Z", "Y", "Z", "Y"],
        "class":
            ["english", "english", "english", "english",
             "math", "math", "math", "math",
             "physics", "physics", "physics", "physics"],
        "grade":
            [10, 100, 1000, 10000,
             20, 200, 2000, 20000,
             30, 300, 3000, 30000]
})
df_long

   student school    class  grade
0     Andy      Z  english     10
1   Bernie      Y  english    100
2    Cindy      Z  english   1000
3      Deb      Y  english  10000
4     Andy      Z     math     20
5   Bernie      Y     math    200
6    Cindy      Z     math   2000
7      Deb      Y     math  20000
8     Andy      Z  physics     30
9   Bernie      Y  physics    300
10   Cindy      Z  physics   3000
11     Deb      Y  physics  30000

## Pivot example 1
---

We often want to keep the identifier columns as they are (**index=["student", "school"]**), but pivot or "split" a column’s values (**values="grade"**) based on another column (**columns="class"**). Compare the original and pivoted dataframes below and you’ll understand what that means.

In [3]:
example1_1 = df_long.pivot_table(index=["student", "school"], 
                    columns='class', 
                    values='grade')
print(example1_1)

class           english   math  physics
student school
Andy    Z            10     20       30
Bernie  Y           100    200      300
Cindy   Z          1000   2000     3000
Deb     Y         10000  20000    30000

In [4]:
example1_2 = df_long.pivot_table(index=["student", "school"], 
                    columns='class', 
                    values='grade').reset_index()
print(example1_2)

class student school  english   math  physics
0        Andy      Z       10     20       30
1      Bernie      Y      100    200      300
2       Cindy      Z     1000   2000     3000
3         Deb      Y    10000  20000    30000

Each unique value in the class column will be a new column (english, math, physics) in the pivoted/wide dataframe. We can also provide a **list** to the columns parameter.

To get rid of the multi-index, use **reset_index()**.

## Pivot example 2
---

You can also aggregate each resulting row and column by specifying **margins=True** (default **False**).

Here we aggregate by computing the sum via **aggfunc='sum'** (default **'mean'**).

In [5]:
example2_1 = df_long.pivot_table(index=["student", "school"], 
                    columns='class', 
                    values='grade',
                    margins=True,      # add margins
                    aggfunc='sum')     # sum margins (rows/columns)
print(example2_1)

class           english   math  physics    All
student school
Andy    Z            10     20       30     60
Bernie  Y           100    200      300    600
Cindy   Z          1000   2000     3000   6000
Deb     Y         10000  20000    30000  60000
All               11110  22220    33330  66660

In [6]:
example2_2 = df_long.pivot_table(index=["student", "school"], 
                    columns='class', 
                    values='grade',
                    margins=True,                    # add margins
                    aggfunc='sum').reset_index()     # sum margins (rows/columns)
print(example2_2)

class student school  english   math  physics    All
0        Andy      Z       10     20       30     60
1      Bernie      Y      100    200      300    600
2       Cindy      Z     1000   2000     3000   6000
3         Deb      Y    10000  20000    30000  60000
4         All           11110  22220    33330  66660

There are many other aggregation functions you can use (e.g.,**'median' 'sum' 'max'**). You can also specify multiple functions as a list (e.g.,**aggfunc=['mean', 'sum']**).

## Pivot example 3
---

In [7]:
example3_1 = df_long.pivot_table(index=["student", "school"]).reset_index()
print(example3_1)

  student school  grade
0    Andy      Z     20
1  Bernie      Y    200
2   Cindy      Z   2000
3     Deb      Y  20000

In [8]:
example3_2 = df_long.groupby(["student", "school"]).mean().reset_index()
print(example3_2)

  student school  grade
0    Andy      Z     20
1  Bernie      Y    200
2   Cindy      Z   2000
3     Deb      Y  20000

In [9]:
example3_3 = df_long.pivot_table(index=["student", "school"],
                                 aggfunc=["max", "first"])
print(example3_3)

                    max           first
                  class  grade    class  grade
student school
Andy    Z       physics     30  english     10
Bernie  Y       physics    300  english    100
Cindy   Z       physics   3000  english   1000
Deb     Y       physics  30000  english  10000

In [10]:
example3_4 = df_long.groupby(["student", "school"]).agg(["max", "first"])
print(example3_4)

                  class           grade
                    max    first    max  first
student school
Andy    Z       physics  english     30     10
Bernie  Y       physics  english    300    100
Cindy   Z       physics  english   3000   1000
Deb     Y       physics  english  30000  10000

## Pivot example 4
---

In [11]:
example4_1 = df_long.pivot_table(index="student",
                                 columns=["school", "class"],
                                 values="grade")
print(example4_1)

school         Y                         Z
class    english     math  physics english    math physics
student
Andy         NaN      NaN      NaN    10.0    20.0    30.0
Bernie     100.0    200.0    300.0     NaN     NaN     NaN
Cindy        NaN      NaN      NaN  1000.0  2000.0  3000.0
Deb      10000.0  20000.0  30000.0     NaN     NaN     NaN

In [12]:
example4_2 = df_long.pivot_table(index="student",
                                 columns=["school", "class"],
                                 values="grade",
                                 fill_value=-5)
print(example4_2)

school        Y                      Z
class   english   math physics english  math physics
student
Andy         -5     -5      -5      10    20      30
Bernie      100    200     300      -5    -5      -5
Cindy        -5     -5      -5    1000  2000    3000
Deb       10000  20000   30000      -5    -5      -5